In [18]:
import pandas as pd

In [19]:
df1 = pd.read_csv('data1.csv')
df2 = pd.read_csv('data2.csv')

display(df1.columns)
display(df2.columns)

Index(['fid', 'name', 'population', 'county', 'latitude'], dtype='object')

Index(['name', 'population', 'county', 'longitude', 'level', 'enrollment',
       'level.1'],
      dtype='object')

In [20]:
display(df1.head())
display(df2.head())

,fid,name,population,county,latitude
0,9001,NEW ENGLAND CHRISTIAN ACADEMY,136,BRISTOL,41.758597
1,9002,SETON ACADEMY FOR GIRLS,57,BRISTOL,41.718407
2,9003,ST ANNA SCHOOL,157,WORCESTER,42.517271
3,9004,SOUTHEAST ALTERNATIVE SCHOOL-MIDDLE SCHOOL,5,PLYMOUTH,41.818210
4,9005,DEVEREUX SCHOOL,123,WORCESTER,42.383875

,name,population,county,longitude,level,enrollment,level.1
0,NEW ENGLAND CHRISTIAN ACADEMY,136,BRISTOL,-71.175801,Combined elementary and secondary,120,Combined elementary and secondary
1,SETON ACADEMY FOR GIRLS,57,BRISTOL,-71.147302,Elementary,49,Elementary
2,ST ANNA SCHOOL,157,WORCESTER,-71.751741,Elementary,143,Elementary
3,SOUTHEAST ALTERNATIVE SCHOOL-MIDDLE SCHOOL,5,PLYMOUTH,-71.083393,Elementary,4,Elementary
4,DEVEREUX SCHOOL,123,WORCESTER,-71.968419,Combined elementary and secondary,107,Combined elementary and secondary

In [21]:

df = df1.merge(df2, on=list(set(df1.columns) & set(df2.columns)))

df.head()

,fid,name,population,county,latitude,longitude,level,enrollment,level.1
0,9001,NEW ENGLAND CHRISTIAN ACADEMY,136,BRISTOL,41.758597,-71.175801,Combined elementary and secondary,120,Combined elementary and secondary
1,9002,SETON ACADEMY FOR GIRLS,57,BRISTOL,41.718407,-71.147302,Elementary,49,Elementary
2,9003,ST ANNA SCHOOL,157,WORCESTER,42.517271,-71.751741,Elementary,143,Elementary
3,9004,SOUTHEAST ALTERNATIVE SCHOOL-MIDDLE SCHOOL,5,PLYMOUTH,41.818210,-71.083393,Elementary,4,Elementary
4,9005,DEVEREUX SCHOOL,123,WORCESTER,42.383875,-71.968419,Combined elementary and secondary,107,Combined elementary and secondary

In [22]:
df.shape

(27033, 9)

In [25]:
df3 = pd.read_csv('data3.csv')

df3.head()

      county        city  score
0    BRISTOL     SWANSEA     16
1    BRISTOL  FALL RIVER      8
2  WORCESTER  LEOMINSTER     14
3   PLYMOUTH  MIDDLEBORO      1
4  WORCESTER     RUTLAND     16

In [29]:
comboAC = df1.merge(df3, on=list(set(df1.columns) & set(df3.columns)))

comboAC.shape

(4221333, 7)